---
kind: other
id: Properties.T:Autodesk.Revit.DB.Extrusion
source: html/edf17bca-0344-3604-3a29-05de0d5eda2b.htm
---
# Extrusion Properties

The id of the assembly instance to which the element belongs.